Revit 2027 API
ElementOnPhaseStatus Enumeration
 The statuses that an element can have with respect to a given phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElementOnPhaseStatus
Public Enumeration ElementOnPhaseStatus
public enum class ElementOnPhaseStatus
type ElementOnPhaseStatus
Members
Member name | Value | Description
Demolished | 3 |  Created before the given phase, to be demolished on the given phase
Existing | 2 |  Created in a previous phase, existing through the end of the given phase
Future | 6 |  Created after this phase
New | 4 |  Created on this phase (and not demolished)
None | 0 |  Phase status is undefined (e.g., for annotations)
Past | 1 |  Created and demolished before the given phase
Temporary | 5 |  Created and demolished during this phase
See Also
Reference
Autodesk.Revit.DB Namespace